In [1]:
%matplotlib inline

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
from pathlib import Path

# Import your data into a Pandas DataFrame.

In [11]:
ride_csv = Path("/Users/jeremy/Docs/OSU_Bootcamp/Mod_5_PyBer/PyBer_Analysis/Resources/ride_data.csv")
city_csv = Path("/Users/jeremy/Docs/OSU_Bootcamp/Mod_5_PyBer/PyBer_Analysis/Resources/city_data.csv")

city_df = pd.read_csv(city_csv)
ride_df = pd.read_csv(ride_csv)

In [12]:
city_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [13]:
ride_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344


# Inspect/Merge your DataFrames.

##### Inspecting city_df

In [4]:
# Get all the rows that contain null values.
city_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [5]:
# Make sure the driver_count column has an integer data type.
city_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [10]:
# Find out how many data points there are for each type of city.
city_df['type'].value_counts()

Urban       66
Suburban    36
Rural       18
Name: type, dtype: int64

##### Inspect ride_df

In [7]:
# Get all the rows that contain null values.
ride_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [8]:
# Make sure the driver_count column has an integer data type.
ride_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [14]:
Pyber_df = pd.merge(ride_df,city_df,how='left',on=['city','city'])

Pyber_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

# Create a bubble chart that showcases the average fare versus the total number of rides with bubble size based on the total number of drivers for each city type, including urban, suburban, and rural.

# Determine the mean, median, and mode for the following:

# The total number of rides for each city type.

# The average fares for each city type.

# The total number of drivers for each city type.

# Create box-and-whisker plots that visualize each of the following to determine if there are any outliers:

# The number of rides for each city type.

# The fares for each city type.

# The number of drivers for each city type.

# Create a pie chart that visualizes each of the following data for each city type:

# The percent of total fares.

# The percent of total rides.

# The percent of total drivers.